## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 12 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  RESOURCE                                  |
|--------|----------------------------------------------------------------------------|
| add    | `aws_iam_role.superset_waf_logs`                                           |
|        | `aws_iam_role_policy.superset_waf_logs`                                    |
|        | `aws_kinesis_firehose_delivery_stream.superset_waf_logs`                   |
|        | `aws_wafv2_web_acl_logging_configuration.superset_waf_logs`                |
|        | `module.athena_access_logs.aws_athena_database.logs`                       |
|        | `module.athena_access_logs.aws_athena_named_query.lb_create_table[0]`      |
|        | `module.athena_access_logs.aws_athena_named_query.waf_all_requests[0]`     |
|        | `module.athena_access_logs.aws_athena_named_query.waf_blocked_requests[0]` |
|        | `module.athena_access_logs.aws_athena_named_query.waf_create_table[0]`     |
|        | `module.athena_access_logs.aws_athena_workgroup.logs`                      |
|        | `module.athena_bucket.aws_s3_bucket.this`                                  |
|        | `module.athena_bucket.aws_s3_bucket_public_access_block.this`              |
| update | `aws_cloudwatch_metric_alarm.superset_load_balancer_healthy_hosts`         |
|        | `aws_lb.superset`                                                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.superset_load_balancer_healthy_hosts will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_healthy_hosts" {
      ~ alarm_description                     = ":dumpster-fire: there are no healthy hosts for the Superset load balance in a 1 minute period." -> ":dumpster-fire: there are no healthy hosts for the Superset load balancer in a 1 minute period."
        id                                    = "load-balancer-healthy-hosts"
        tags                                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (21 unchanged attributes hidden)
    }

  # aws_iam_role.superset_waf_logs will be created
  + resource "aws_iam_role" "superset_waf_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "superset-waf-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.superset_waf_logs will be created
  + resource "aws_iam_role_policy" "superset_waf_logs" {
      + id          = (known after apply)
      + name        = "superset-waf-logs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cbs-satellite-066023111852/*",
                          + "arn:aws:s3:::cbs-satellite-066023111852",
                        ]
                    },
                  + {
                      + Action   = "iam:CreateServiceLinkedRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/aws-service-role/wafv2.amazonaws.com/AWSServiceRoleForWAFV2Logging"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_kinesis_firehose_delivery_stream.superset_waf_logs will be created
  + resource "aws_kinesis_firehose_delivery_stream" "superset_waf_logs" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-superset"
      + tags_all       = (known after apply)
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-066023111852"
          + buffering_interval = 300
          + buffering_size     = 5
          + compression_format = "GZIP"
          + custom_time_zone   = "UTC"
          + prefix             = "waf_acl_logs/AWSLogs/066023111852/"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_lb.superset will be updated in-place
  ~ resource "aws_lb" "superset" {
        id                                                           = "arn:aws:elasticloadbalancing:ca-central-1:066023111852:loadbalancer/app/superset-prod/d9046c2b02959d94"
        name                                                         = "superset-prod"
        tags                                                         = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (26 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "cbs-satellite-066023111852"
          ~ enabled = false -> true
          + prefix  = "lb_logs"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.superset_waf_logs will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "superset_waf_logs" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:ca-central-1:066023111852:regional/webacl/superset_lb/01023b01-f866-450a-9eab-8359b1b45d4f"
    }

  # module.athena_access_logs.aws_athena_database.logs will be created
  + resource "aws_athena_database" "logs" {
      + bucket        = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "access_logs"

      + encryption_configuration {
          + encryption_option = "SSE_S3"
        }
    }

  # module.athena_access_logs.aws_athena_named_query.lb_create_table[0] will be created
  + resource "aws_athena_named_query" "lb_create_table" {
      + database  = "access_logs"
      + id        = (known after apply)
      + name      = "LB: create table"
      + query     = <<-EOT
            CREATE EXTERNAL TABLE IF NOT EXISTS `access_logs.lb_logs` (
                type string,
                time string,
                elb string,
                client_ip string,
                client_port int,
                target_ip string,
                target_port int,
                request_processing_time double,
                target_processing_time double,
                response_processing_time double,
                elb_status_code int,
                target_status_code string,
                received_bytes bigint,
                sent_bytes bigint,
                request_verb string,
                request_url string,
                request_proto string,
                user_agent string,
                ssl_cipher string,
                ssl_protocol string,
                target_group_arn string,
                trace_id string,
                domain_name string,
                chosen_cert_arn string,
                matched_rule_priority string,
                request_creation_time string,
                actions_executed string,
                redirect_url string,
                lambda_error_reason string,
                target_port_list string,
                target_status_code_list string,
                classification string,
                classification_reason string,
                conn_trace_id string
                )
                ROW FORMAT SERDE 'org.apache.hadoop.hive.serde2.RegexSerDe'
                WITH SERDEPROPERTIES (
                'serialization.format' = '1',
                'input.regex' = 
            '([^ ]*) ([^ ]*) ([^ ]*) ([^ ]*):([0-9]*) ([^ ]*)[:-]([0-9]*) ([-.0-9]*) ([-.0-9]*) ([-.0-9]*) (|[-0-9]*) (-|[-0-9]*) ([-0-9]*) ([-0-9]*) \"([^ ]*) (.*) (- |[^ ]*)\" \"([^\"]*)\" ([A-Z0-9-_]+) ([A-Za-z0-9.-]*) ([^ ]*) \"([^\"]*)\" \"([^\"]*)\" \"([^\"]*)\" ([-.0-9]*) ([^ ]*) \"([^\"]*)\" \"([^\"]*)\" \"([^ ]*)\" \"([^\s]+?)\" \"([^\s]+)\" \"([^ ]*)\" \"([^ ]*)\" ?([^ ]*)?( .*)?')
                LOCATION 's3://cbs-satellite-066023111852/lb_logs/AWSLogs/066023111852/elasticloadbalancing/ca-central-1/';
        EOT
      + workgroup = "logs"
    }

  # module.athena_access_logs.aws_athena_named_query.waf_all_requests[0] will be created
  + resource "aws_athena_named_query" "waf_all_requests" {
      + database  = "access_logs"
      + id        = (known after apply)
      + name      = "WAF: all requests"
      + query     = <<-EOT
            SELECT 
                date_format(from_unixtime(timestamp / 1000e0), '%Y-%m-%d %T') as time, 
                httprequest.httpmethod, httprequest.uri, action, httprequest
            FROM "access_logs"."waf_logs"
            WHERE httprequest.uri <> '/healthcheck'
            ORDER BY time DESC;
        EOT
      + workgroup = "logs"
    }

  # module.athena_access_logs.aws_athena_named_query.waf_blocked_requests[0] will be created
  + resource "aws_athena_named_query" "waf_blocked_requests" {
      + database  = "access_logs"
      + id        = (known after apply)
      + name      = "WAF: blocked requests"
      + query     = <<-EOT
            WITH data AS (
                SELECT
                    date_format(from_unixtime(timestamp / 1000e0), '%Y-%m-%d') as time, header.value as host, action,
                    terminatingruleid,
                    httprequest.clientip, httprequest.country, httprequest.httpmethod, httprequest.uri
                FROM "access_logs"."waf_logs"
                CROSS JOIN UNNEST(httprequest.headers) AS t(header)
                WHERE lower(header.name) = 'host'
                AND action = 'BLOCK'
            )
            SELECT
                min(time) as start_date, max(time) as end_date,
                count(*) as num,
                clientip, country,
                array_join(array_agg(distinct terminatingruleid), ', ') as terminatingruleid,
                host,
                array_join(array_agg(distinct uri), ', ') as uris
            FROM data
            GROUP BY clientip, country, host
            ORDER BY end_date DESC
        EOT
      + workgroup = "logs"
    }

  # module.athena_access_logs.aws_athena_named_query.waf_create_table[0] will be created
  + resource "aws_athena_named_query" "waf_create_table" {
      + database  = "access_logs"
      + id        = (known after apply)
      + name      = "WAF: create table"
      + query     = <<-EOT
            CREATE EXTERNAL TABLE `access_logs.waf_logs`(
              `timestamp` bigint, 
              `formatversion` int, 
              `webaclid` string, 
              `terminatingruleid` string, 
              `terminatingruletype` string, 
              `action` string, 
              `terminatingrulematchdetails` array<
                                                struct<
                                                    conditiontype:string,
                                                    location:string,
                                                    matcheddata:array<string>
                                                       >
                                                >, 
              `httpsourcename` string, 
              `httpsourceid` string, 
              `rulegrouplist` array<
                                  struct<
                                      rulegroupid:string,
                                      terminatingrule:struct<
                                                          ruleid:string,
                                                          action:string,
                                                          rulematchdetails:string
                                                            >,
                                      nonterminatingmatchingrules:array<string>,
                                      excludedrules:string
                                        >
                                   >, 
             `ratebasedrulelist` array<
                                     struct<
                                         ratebasedruleid:string,
                                         limitkey:string,
                                         maxrateallowed:int
                                           >
                                      >, 
              `nonterminatingmatchingrules` array<
                                                struct<
                                                    ruleid:string,
                                                    action:string
                                                      >
                                                 >, 
              `requestheadersinserted` string, 
              `responsecodesent` string, 
              `httprequest` struct<
                                clientip:string,
                                country:string,
                                headers:array<
                                            struct<
                                                name:string,
                                                value:string
                                                  >
                                             >,
                                uri:string,
                                args:string,
                                httpversion:string,
                                httpmethod:string,
                                requestid:string
                                  >, 
              `labels` array<
                           struct<
                               name:string
                                 >
                            >, 
              `captcharesponse` struct<
                                    responsecode:string,
                                    solvetimestamp:string,
                                    failureReason:string
                                      > 
            )
            ROW FORMAT SERDE 'org.openx.data.jsonserde.JsonSerDe'
            STORED AS INPUTFORMAT 'org.apache.hadoop.mapred.TextInputFormat'
            OUTPUTFORMAT 'org.apache.hadoop.hive.ql.io.HiveIgnoreKeyTextOutputFormat'
            LOCATION 's3://cbs-satellite-066023111852/waf_acl_logs/AWSLogs/066023111852/'
        EOT
      + workgroup = "logs"
    }

  # module.athena_access_logs.aws_athena_workgroup.logs will be created
  + resource "aws_athena_workgroup" "logs" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "logs"
      + state         = "ENABLED"
      + tags          = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }

      + configuration {
          + enforce_workgroup_configuration    = true
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + result_configuration {
              + output_location = (known after apply)

              + encryption_configuration {
                  + encryption_option = "SSE_S3"
                }
            }
        }
    }

  # module.athena_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cds-superset-prod-athena"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "cds-superset-prod"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cds-superset-prod"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire-objects"

          + expiration {
              + days = 30
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }
    }

  # module.athena_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 12 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.notify"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.data_export"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
